% 4-2(2)
% 对于三次样条插值的三弯矩方法，编制用于第一种和第二种边界条件的程序。
% xi   0.25   0.30   0.39   0.45   0.53
% yi  0.5000 0.5477 0.6245 0.6708 0.7280
% 第一种边界条件： s'(0.25)=1.0000, s'(0.53)=0.6868
% 第二种边界条件： s"(0.25)=s"(0.53)=0
% 分别用所编程序求解，输出各个插值节点的弯矩值{Mi}和插值中点的样条函数值，并做点列{xi,yi}和样条函数y=s(x)的图形
A=zeros(5);
b=zeros(5,1);
x=[0.25,0.30,0.39,0.45,0.53];
y=[0.5000,0.5477,0.6245,0.6708,0.7280];

%非边界点参数
for i=2:4
    h1=x(1,i)-x(1,i-1);
    h2=x(1,i+1)-x(1,i);
    f12=(y(1,i)-y(1,i-1))/h1;
    f23=(y(1,i+1)-y(1,i))/h2;
    u=h1/(h1+h2);
    r=1-u;
    f123=(f12-f23)/(x(1,i-1)-x(1,i+1));
    d=6*f123;
    A(i-1,i-1)=u;
    A(i-1,i)=2;
    A(i-1,i+1)=r;
    b(i-1,1)=d;
end
%边界点
A(4,1)=2;
b(4,1)=0;
A(5,5)=2;
b(5,1)=0;

%矩阵M
M=inv(A)*b
%插值公式
yip=0;
syms xip
for i=1:4
    h=x(1,i+1)-x(1,i);
    yip=yip+(M(i,1)*(x(1,i+1)-xip)^3/6/h+M(i+1,1)*(xip-x(1,i))^3/6/h+(y(1,i)-M(i,1)*h^2/6)*(x(1,i+1)-xip)/h+(y(1,i+1)-M(i+1,1)*h^2/6)*(xip-x(1,i))/h)*(xip<=x(1,i+1)&xip>x(1,i));
end
%节点中值
for i=1:4
    xm(1,i)=eval(subs(yip,xip,(x(1,i)+x(1,1+i))/2));
end
A
b
xm
%结果
x=0.251:0.001:0.53;
yip=eval(subs(yip,xip,x));
plot(x,yip);
hold on
x=[0.25,0.30,0.39,0.45,0.53];
y=[0.5000,0.5477,0.6245,0.6708,0.7280];
plot(x,y,'ro')